Emsloan/arduino-tests/Boards Menu Options/Option3Boards/boards.txt
##### avrda5 settings #####
avrda5.upload.tool=avrdude
avrda5.upload.prog_interlock=
avrda5.build.board=avrda
avrda5.build.core=dxcore
avrda5.build.text_section_start=.text=0x0
avrda5.build.export_merged_output=false
avrda5.build.mcupostfix=
avrda5.build.printf=
avrda5.build.printfabr=
avrda5.build.attachabr=
avrda5.build.wireabr=
avrda5.build.appspmabr=.spm{bootloader.CODESIZE}
avrda5.bootloader.tool=avrdude
avrda5.bootloader.WDTCFG=0x00
avrda5.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrda5.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda5.bootloader.CODESIZE=0x00
avrda5.bootloader.BOOTSIZE=0x01
avrda5.bootloader.avrdudestring=
avrda5.bootloader.pymcuprogstring=-aerase
avrda5.bootloader.appspm=
avrda5.bootloader.BOOTSIZE=0x00
avrda5.menu.chip.128DA48=AVR128DA48
avrda5.menu.chip.128DA48.build.mcu=avr128da48
avrda5.menu.chip.128DA48.upload.maximum_size=131072
avrda5.menu.chip.128DA48.upload.maximum_data_size=16384
avrda5.menu.chip.128DA48.build.variant=48pin-standard
avrda5.build.f_cpu=24000000L
avrda5.build.speed=24
avrda5.bootloader.bodlevbits=000
avrda5.bootloader.eesavebit=1
avrda5.bootloader.resetpinbits=10
avrda5.bootloader.SYSCFG1=0x04

##### avrda6 settings #####
avrda6.upload.tool=avrdude
avrda6.upload.prog_interlock=
avrda6.build.board=avrda
avrda6.build.core=dxcore
avrda6.build.text_section_start=.text=0x0
avrda6.build.export_merged_output=false
avrda6.build.mcupostfix=
avrda6.build.printf=
avrda6.build.printfabr=
avrda6.build.attachabr=
avrda6.build.wireabr=
avrda6.build.appspmabr=.spm{bootloader.CODESIZE}
avrda6.bootloader.tool=avrdude
avrda6.bootloader.WDTCFG=0x00
avrda6.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrda6.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda6.bootloader.CODESIZE=0x00
avrda6.bootloader.BOOTSIZE=0x01
avrda6.bootloader.avrdudestring=
avrda6.bootloader.pymcuprogstring=-aerase
avrda6.bootloader.appspm=
avrda6.bootloader.BOOTSIZE=0x00
avrda6.menu.chip.128DA48=AVR128DA48
avrda6.menu.chip.128DA48.build.mcu=avr128da48
avrda6.menu.chip.128DA48.upload.maximum_size=131072
avrda6.menu.chip.128DA48.upload.maximum_data_size=16384
avrda6.menu.chip.128DA48.build.variant=48pin-standard
avrda6.build.f_cpu=24000000L
avrda6.build.speed=24
avrda6.bootloader.bodlevbits=000
avrda6.bootloader.eesavebit=1
avrda6.bootloader.resetpinbits=10
avrda6.bootloader.SYSCFG1=0x04

##### avrdb1 settings #####
avrdb1.upload.tool=avrdude
avrdb1.upload.prog_interlock=
avrdb1.build.board=avrdb
avrdb1.build.core=dxcore
avrdb1.build.text_section_start=.text=0x0
avrdb1.build.export_merged_output=false
avrdb1.build.mcupostfix=
avrdb1.build.printf=
avrdb1.build.printfabr=
avrdb1.build.attachabr=
avrdb1.build.wireabr=
avrdb1.build.appspmabr=.spm{bootloader.CODESIZE}
avrdb1.bootloader.tool=avrdude
avrdb1.bootloader.WDTCFG=0x00
avrdb1.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrdb1.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb1.bootloader.CODESIZE=0x00
avrdb1.bootloader.BOOTSIZE=0x01
avrdb1.bootloader.avrdudestring=
avrdb1.bootloader.pymcuprogstring=-aerase
avrdb1.bootloader.appspm=
avrdb1.bootloader.BOOTSIZE=0x00
avrdb1.menu.chip.128DB48=AVR128DB48
avrdb1.menu.chip.128DB48.build.mcu=AVR128DB48
avrdb1.menu.chip.128DB48.upload.maximum_size=131072
avrdb1.menu.chip.128DB48.upload.maximum_data_size=16384
avrdb1.menu.chip.128DB48.build.variant=48pin-standard
avrdb1.build.f_cpu=24000000L
avrdb1.build.speed=24
avrdb1.bootloader.bodlevbits=000
avrdb1.bootloader.eesavebit=1
avrdb1.bootloader.resetpinbits=10
avrdb1.bootloader.SYSCFG1=0x04

##### avrdb2 settings #####
avrdb2.upload.tool=avrdude
avrdb2.upload.prog_interlock=
avrdb2.build.board=avrdb
avrdb2.build.core=dxcore
avrdb2.build.text_section_start=.text=0x0
avrdb2.build.export_merged_output=false
avrdb2.build.mcupostfix=
avrdb2.build.printf=
avrdb2.build.printfabr=
avrdb2.build.attachabr=
avrdb2.build.wireabr=
avrdb2.build.appspmabr=.spm{bootloader.CODESIZE}
avrdb2.bootloader.tool=avrdude
avrdb2.bootloader.WDTCFG=0x00
avrdb2.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrdb2.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb2.bootloader.CODESIZE=0x00
avrdb2.bootloader.BOOTSIZE=0x01
avrdb2.bootloader.avrdudestring=
avrdb2.bootloader.pymcuprogstring=-aerase
avrdb2.bootloader.appspm=
avrdb2.bootloader.BOOTSIZE=0x00
avrdb2.menu.chip.128DB48=AVR128DB48
avrdb2.menu.chip.128DB48.build.mcu=AVR128DB48
avrdb2.menu.chip.128DB48.upload.maximum_size=131072
avrdb2.menu.chip.128DB48.upload.maximum_data_size=16384
avrdb2.menu.chip.128DB48.build.variant=48pin-standard
avrdb2.build.f_cpu=24000000L
avrdb2.build.speed=24
avrdb2.bootloader.bodlevbits=000
avrdb2.bootloader.eesavebit=1
avrdb2.bootloader.resetpinbits=10
avrdb2.bootloader.SYSCFG1=0x04

##### avrdb3 settings #####
avrdb3.upload.tool=avrdude
avrdb3.upload.prog_interlock=
avrdb3.build.board=avrdb
avrdb3.build.core=dxcore
avrdb3.build.text_section_start=.text=0x0
avrdb3.build.export_merged_output=false
avrdb3.build.mcupostfix=
avrdb3.build.printf=
avrdb3.build.printfabr=
avrdb3.build.attachabr=
avrdb3.build.wireabr=
avrdb3.build.appspmabr=.spm{bootloader.CODESIZE}
avrdb3.bootloader.tool=avrdude
avrdb3.bootloader.WDTCFG=0x00
avrdb3.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrdb3.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb3.bootloader.CODESIZE=0x00
avrdb3.bootloader.BOOTSIZE=0x01
avrdb3.bootloader.avrdudestring=
avrdb3.bootloader.pymcuprogstring=-aerase
avrdb3.bootloader.appspm=
avrdb3.bootloader.BOOTSIZE=0x00
avrdb3.menu.chip.128DB48=AVR128DB48
avrdb3.menu.chip.128DB48.build.mcu=AVR128DB48
avrdb3.menu.chip.128DB48.upload.maximum_size=131072
avrdb3.menu.chip.128DB48.upload.maximum_data_size=16384
avrdb3.menu.chip.128DB48.build.variant=48pin-standard
avrdb3.build.f_cpu=24000000L
avrdb3.build.speed=24
avrdb3.bootloader.bodlevbits=000
avrdb3.bootloader.eesavebit=1
avrdb3.bootloader.resetpinbits=10
avrdb3.bootloader.SYSCFG1=0x04

##### avrdb4 settings #####
avrdb4.upload.tool=avrdude
avrdb4.upload.prog_interlock=
avrdb4.build.board=avrdb
avrdb4.build.core=dxcore
avrdb4.build.text_section_start=.text=0x0
avrdb4.build.export_merged_output=false
avrdb4.build.mcupostfix=
avrdb4.build.printf=
avrdb4.build.printfabr=
avrdb4.build.attachabr=
avrdb4.build.wireabr=
avrdb4.build.appspmabr=.spm{bootloader.CODESIZE}
avrdb4.bootloader.tool=avrdude
avrdb4.bootloader.WDTCFG=0x00
avrdb4.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrdb4.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb4.bootloader.CODESIZE=0x00
avrdb4.bootloader.BOOTSIZE=0x01
avrdb4.bootloader.avrdudestring=
avrdb4.bootloader.pymcuprogstring=-aerase
avrdb4.bootloader.appspm=
avrdb4.bootloader.BOOTSIZE=0x00
avrdb4.menu.chip.128DB48=AVR128DB48
avrdb4.menu.chip.128DB48.build.mcu=AVR128DB48
avrdb4.menu.chip.128DB48.upload.maximum_size=131072
avrdb4.menu.chip.128DB48.upload.maximum_data_size=16384
avrdb4.menu.chip.128DB48.build.variant=48pin-standard
avrdb4.build.f_cpu=24000000L
avrdb4.build.speed=24
avrdb4.bootloader.bodlevbits=000
avrdb4.bootloader.eesavebit=1
avrdb4.bootloader.resetpinbits=10
avrdb4.bootloader.SYSCFG1=0x04

