Emsloan/arduino-tests/Boards Menu Options/Option3Boards/boards.txt
##### avrdb5 settings #####
avrdb5.upload.tool=avrdude
avrdb5.upload.prog_interlock=
avrdb5.build.board=avrdb
avrdb5.build.core=dxcore
avrdb5.build.text_section_start=.text=0x0
avrdb5.build.export_merged_output=false
avrdb5.build.mcupostfix=
avrdb5.build.printf=
avrdb5.build.printfabr=
avrdb5.build.attachabr=
avrdb5.build.wireabr=
avrdb5.build.appspmabr=.spm{bootloader.CODESIZE}
avrdb5.bootloader.tool=avrdude
avrdb5.bootloader.WDTCFG=0x00
avrdb5.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrdb5.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb5.bootloader.CODESIZE=0x00
avrdb5.bootloader.BOOTSIZE=0x01
avrdb5.bootloader.avrdudestring=
avrdb5.bootloader.pymcuprogstring=-aerase
avrdb5.bootloader.appspm=
avrdb5.bootloader.BOOTSIZE=0x00
avrdb5.menu.chip.128DB48=AVR128DB48
avrdb5.menu.chip.128DB48.build.mcu=AVR128DB48
avrdb5.menu.chip.128DB48.upload.maximum_size=131072
avrdb5.menu.chip.128DB48.upload.maximum_data_size=16384
avrdb5.menu.chip.128DB48.build.variant=48pin-standard
avrdb5.build.f_cpu=24000000L
avrdb5.build.speed=24
avrdb5.bootloader.bodlevbits=000
avrdb5.bootloader.eesavebit=1
avrdb5.bootloader.resetpinbits=10
avrdb5.bootloader.SYSCFG1=0x04

##### avrdb6 settings #####
avrdb6.upload.tool=avrdude
avrdb6.upload.prog_interlock=
avrdb6.build.board=avrdb
avrdb6.build.core=dxcore
avrdb6.build.text_section_start=.text=0x0
avrdb6.build.export_merged_output=false
avrdb6.build.mcupostfix=
avrdb6.build.printf=
avrdb6.build.printfabr=
avrdb6.build.attachabr=
avrdb6.build.wireabr=
avrdb6.build.appspmabr=.spm{bootloader.CODESIZE}
avrdb6.bootloader.tool=avrdude
avrdb6.bootloader.WDTCFG=0x00
avrdb6.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrdb6.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb6.bootloader.CODESIZE=0x00
avrdb6.bootloader.BOOTSIZE=0x01
avrdb6.bootloader.avrdudestring=
avrdb6.bootloader.pymcuprogstring=-aerase
avrdb6.bootloader.appspm=
avrdb6.bootloader.BOOTSIZE=0x00
avrdb6.menu.chip.128DB48=AVR128DB48
avrdb6.menu.chip.128DB48.build.mcu=AVR128DB48
avrdb6.menu.chip.128DB48.upload.maximum_size=131072
avrdb6.menu.chip.128DB48.upload.maximum_data_size=16384
avrdb6.menu.chip.128DB48.build.variant=48pin-standard
avrdb6.build.f_cpu=24000000L
avrdb6.build.speed=24
avrdb6.bootloader.bodlevbits=000
avrdb6.bootloader.eesavebit=1
avrdb6.bootloader.resetpinbits=10
avrdb6.bootloader.SYSCFG1=0x04

##### AVR128DA48 #####
##### 1x Wire, Minimal Float #####
avrda1.build.wire.mode=MORS_SINGLE
avrda1.build.wireabr=.wO
avrda1.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda1.build.printfabr=.pfM

##### 2x Wire, Minimal Float #####
avrda2.build.wire.mode=MORS_BOTH
avrda2.build.wireabr=.wO2
avrda2.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda2.build.printfabr=.pfM

##### 1x Wire, No Float #####
avrda3.build.wire.mode=MORS_SINGLE
avrda3.build.wireabr=.wO

##### 2x Wire, No Float #####
avrda4.build.wire.mode=MORS_BOTH
avrda4.build.wireabr=.wO2

##### 1x Wire, Full Float #####
avrda5.build.wire.mode=MORS_SINGLE
avrda5.build.wireabr=.wO
avrda5.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda5.build.printfabr=.pfF

##### 2x Wire, Full Float #####
avrda6.build.wire.mode=MORS_BOTH
avrda6.build.wireabr=.wO2
avrda6.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda6.build.printfabr=.pfF

##### AVR128DB48 #####
##### 1x Wire, Minimal Float #####
avrdb1.build.wire.mode=MORS_SINGLE
avrdb1.build.wireabr=.wO
avrdb1.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdb1.build.printfabr=.pfM

##### 2x Wire, Minimal Float #####
avrdb2.build.wire.mode=MORS_BOTH
avrdb2.build.wireabr=.wO2
avrdb2.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdb2.build.printfabr=.pfM

##### 1x Wire, No Float #####
avrdb3.build.wire.mode=MORS_SINGLE
avrdb3.build.wireabr=.wO

##### 2x Wire, No Float #####
avrdb4.build.wire.mode=MORS_BOTH
avrdb4.build.wireabr=.wO2

##### 1x Wire, Full Float #####
avrdb5.build.wire.mode=MORS_SINGLE
avrdb5.build.wireabr=.wO
avrdb5.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdb5.build.printfabr=.pfF

##### 2x Wire, Full Float #####
avrdb6.build.wire.mode=MORS_BOTH
avrdb6.build.wireabr=.wO2
avrdb6.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdb6.build.printfabr=.pfF

################################ End OPTION 3 ##################################
